app/controllers/donors/users_controller.rb

	def dashboard
		@receipts  = TaxReceipt.all
		@donations_count= current_user.donations.count
		soldiers = current_user.donations.map(&:donated_soldiers)
		@total_soldiers = soldiers&.flatten.uniq.count
		@address = Address.find_by(user_id: current_user.id)
		@donations = Donation.where(user: current_user)
		@receipts = []
		@total_donation = 0
		@donations.each do |donation|
---
SELECT "tax_receipts".* FROM "tax_receipts"
SELECT COUNT(*) FROM "donations" WHERE "donations"."user_id" = $1  [["user_id", 68]]
SELECT "donations".* FROM "donations" WHERE "donations"."user_id" = $1  [["user_id", 68]]
SELECT  "addresses".* FROM "addresses" WHERE "addresses"."user_id" = $1 LIMIT $2  [["user_id", 68], ["LIMIT", 1]]
SELECT  "donations".* FROM "donations" WHERE "donations"."user_id" = $1 LIMIT $2  [["user_id", 62], ["LIMIT", 1]]