app/views/donors/users/_receipts.html.erb

				  		<br>
				  		<%= receipt.donation.user.last_name %>, <%= receipt.donation.user.first_name %>
---
SELECT  "donations".* FROM "donations" WHERE "donations"."id" = $1 LIMIT $2  [["id", 59], ["LIMIT", 1]]
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 105], ["LIMIT", 1]]