app/controllers/soldiers/users_controller.rb

  def dashboard
    @user = current_user
    @total = @user.soldiers_donations.map(&:amount_per_soldier).sum
---
SELECT "soldiers_donations".* FROM "soldiers_donations" WHERE "soldiers_donations"."user_id" = $1  [["user_id", 109]]