app/controllers/charges_controller.rb

INSERT INTO "donations" ("user_id", "amount", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["user_id", 111], ["amount", 500.0], ["created_at", "2019-08-16 05:30:42.578773"], ["updated_at", "2019-08-16 05:30:42.578773"]]
INSERT INTO "tax_receipts" ("number", "donation_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["number", 165207], ["donation_id", 71], ["created_at", "2019-08-16 05:30:42.593039"], ["updated_at", "2019-08-16 05:30:42.593039"]]
SELECT COUNT(*) FROM "users" WHERE "users"."role" = $1  [["role", 0]]
INSERT INTO "soldiers_donations" ("donation_id", "user_id", "amount_per_soldier", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["donation_id", 71], ["user_id", 113], ["amount_per_soldier", 0.0], ["created_at", "2019-08-16 05:30:42.636724"], ["updated_at", "2019-08-16 05:30:42.636724"]]
SELECT "users".* FROM "users" WHERE "users"."role" = $1  [["role", 0]]
---
  def create
    # Amount in cents
    @amount = 500

    customer = Stripe::Customer.create({
      email: params[:stripeEmail],
      source: params[:stripeToken],
    })

    charge = Stripe::Charge.create({
      customer: customer.id,
      amount: @amount,
      description: 'Rails Stripe customer',
      currency: 'usd',
    })

    @donation = Donation.create(amount: @amount, user: current_user)
    TaxReceipt.create(number: rand(100000...500000), donation: @donation)
    @soldier_amount = User.where(role: 0).count
    User.where(role: 0).each { |s| SoldiersDonation.create( user: s, donation: @donation, amount_per_soldier: @soldier_amount / @amount)}